Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/pic32ck0512sg01100.h
/* CMSIS includes */
#include "core_cm33.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cksg01.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CK0512SG01100                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/can.h"
#include "component/ccl.h"
#include "component/cmcc.h"
#include "component/dma.h"
#include "component/dsu.h"
#include "component/ebi.h"
#include "component/eic.h"
#include "component/eth.h"
#include "component/evsys.h"
#include "component/fcr.h"
#include "component/fcw.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/hmatrix2.h"
#include "component/hsm.h"
#include "component/idau.h"
#include "component/mclk.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pcc.h"
#include "component/pdec.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/prm.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sdmmc.h"
#include "component/sercom.h"
#include "component/sig.h"
#include "component/spi_ixs.h"
#include "component/sqi.h"
#include "component/supc.h"
#include "component/tcc.h"
#include "component/tram.h"
#include "component/trng.h"
#include "component/usb.h"
#include "component/usbhs.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CK0512SG01100 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/can0.h"
#include "instance/can1.h"
#include "instance/ccl.h"
#include "instance/cmcc.h"
#include "instance/dma0.h"
#include "instance/dma1.h"
#include "instance/dsu.h"
#include "instance/ebi.h"
#include "instance/eic.h"
#include "instance/eth.h"
#include "instance/evsys.h"
#include "instance/fcr.h"
#include "instance/fcw.h"
#include "instance/fpu_ns.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/hmatrix.h"
#include "instance/hsm.h"
#include "instance/idau.h"
#include "instance/mclk.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pcc.h"
#include "instance/pdec.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/prm.h"
#include "instance/ptc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sdmmc0.h"
#include "instance/sdmmc1.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/sercom6.h"
#include "instance/sercom7.h"
#include "instance/sig.h"
#include "instance/sig_ns.h"
#include "instance/spi_ixs.h"
#include "instance/sqi.h"
#include "instance/supc.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/tcc3.h"
#include "instance/tcc4.h"
#include "instance/tcc5.h"
#include "instance/tcc6.h"
#include "instance/tcc7.h"
#include "instance/tram.h"
#include "instance/trng.h"
#include "instance/usb.h"
#include "instance/usbhs.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CK0512SG01100                          */
/* ************************************************************************** */
#define ID_DSU           (  0) /* Instance index for DSU (DSU) */
#define ID_FCR           (  1) /* Instance index for FCR (FCR) */
#define ID_FCW           (  2) /* Instance index for FCW (FCW) */
#define ID_PM            (  3) /* Instance index for PM (PM) */
#define ID_SUPC          (  4) /* Instance index for SUPC (SUPC) */
#define ID_RSTC          (  5) /* Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  6) /* Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  7) /* Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_GCLK          (  8) /* Instance index for GCLK (GCLK) */
#define ID_MCLK          (  9) /* Instance index for MCLK (MCLK) */
#define ID_FREQM         ( 10) /* Instance index for FREQM (FREQM) */
#define ID_WDT           ( 11) /* Instance index for WDT (WDT) */
#define ID_RTC           ( 12) /* Instance index for RTC (RTC) */
#define ID_EIC           ( 13) /* Instance index for EIC (EIC) */
#define ID_PAC           ( 14) /* Instance index for PAC (PAC) */
#define ID_TRAM          ( 15) /* Instance index for TRAM (TRAM) */
#define ID_PORT          ( 32) /* Instance index for PORT (PORT) */
#define ID_DMA0          ( 33) /* Instance index for DMA0 (DMA0) */
#define ID_DMA1          ( 34) /* Instance index for DMA1 (DMA1) */
#define ID_HMATRIX       ( 35) /* Instance index for HMATRIX (HMATRIX) */
#define ID_CMCC          ( 36) /* Instance index for CMCC (CMCC) */
#define ID_PRM           ( 37) /* Instance index for PRM (PRM) */
#define ID_IDAU          ( 38) /* Instance index for IDAU (IDAU) */
#define ID_EVSYS         ( 39) /* Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 40) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 41) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 42) /* Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 43) /* Instance index for SERCOM3 (SERCOM3) */
#define ID_TCC0          ( 44) /* Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 45) /* Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 46) /* Instance index for TCC2 (TCC2) */
#define ID_TCC3          ( 47) /* Instance index for TCC3 (TCC3) */
#define ID_SERCOM4       ( 64) /* Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 65) /* Instance index for SERCOM5 (SERCOM5) */
#define ID_SERCOM6       ( 66) /* Instance index for SERCOM6 (SERCOM6) */
#define ID_SERCOM7       ( 67) /* Instance index for SERCOM7 (SERCOM7) */
#define ID_TCC4          ( 68) /* Instance index for TCC4 (TCC4) */
#define ID_TCC5          ( 69) /* Instance index for TCC5 (TCC5) */
#define ID_TCC6          ( 70) /* Instance index for TCC6 (TCC6) */
#define ID_TCC7          ( 71) /* Instance index for TCC7 (TCC7) */
#define ID_ADC           ( 72) /* Instance index for ADC (ADC) */
#define ID_AC            ( 73) /* Instance index for AC (AC) */
#define ID_PTC           ( 74) /* Instance index for PTC (PTC) */
#define ID_SPI_IXS       ( 75) /* Instance index for SPI_IXS (SPI_IXS) */
#define ID_PCC           ( 76) /* Instance index for PCC (PCC) */
#define ID_CCL           ( 77) /* Instance index for CCL (CCL) */
#define ID_PDEC          ( 78) /* Instance index for PDEC (PDEC) */
#define ID_CAN0          ( 79) /* Instance index for CAN0 (CAN0) */
#define ID_CAN1          ( 80) /* Instance index for CAN1 (CAN1) */
#define ID_ETH           ( 81) /* Instance index for ETH (ETH) */
#define ID_TRNG          ( 82) /* Instance index for TRNG (TRNG) */
#define ID_SDMMC0        ( 83) /* Instance index for SDMMC0 (SDMMC0) */
#define ID_SDMMC1        ( 84) /* Instance index for SDMMC1 (SDMMC1) */
#define ID_USB           ( 85) /* Instance index for USB (USB) */
#define ID_EBI           ( 86) /* Instance index for EBI (EBI) */
#define ID_SQI           ( 96) /* Instance index for SQI (SQI) */
#define ID_USBHS         ( 97) /* Instance index for USBHS (USBHS) */
#define ID_HSM           ( 98) /* Instance index for HSM (HSM) */

#define ID_PERIPH_MAX    ( 98) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CK0512SG01100            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x45012000)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x45010000)                /* ADC Registers Address        */
#define CAN0_REGS                        ((can_registers_t*)0x4501e000)                /* CAN0 Registers Address       */
#define CAN1_REGS                        ((can_registers_t*)0x45020000)                /* CAN1 Registers Address       */
#define CCL_REGS                         ((ccl_registers_t*)0x4501a000)                /* CCL Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x44808000)               /* CMCC Registers Address       */
#define DMA0_REGS                        ((dma_registers_t*)0x44802000)                /* DMA0 Registers Address       */
#define DMA1_REGS                        ((dma_registers_t*)0x44804000)                /* DMA1 Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x44000000)                /* DSU Registers Address        */
#define EBI_REGS                         ((ebi_registers_t*)0x4502c000)                /* EBI Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x4401a000)                /* EIC Registers Address        */
#define EIC_SEC_REGS                     ((eic_registers_t*)0x4401b000)                /* EIC Registers Address        */
#define ETH_REGS                         ((eth_registers_t*)0x45022000)                /* ETH Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x4480e000)              /* EVSYS Registers Address      */
#define FCR_REGS                         ((fcr_registers_t*)0x44002000)                /* FCR Registers Address        */
#define FCW_REGS                         ((fcw_registers_t*)0x44004000)                /* FCW Registers Address        */
#define FREQM_REGS                       ((freqm_registers_t*)0x44014000)              /* FREQM Registers Address      */
#define FUSES_BOOTCFG1_REGS              ((fuses_bootcfg1_registers_t*)0x0a002000)     /* FUSES Registers Address      */
#define FUSES_BOOTCFG2_REGS              ((fuses_bootcfg1_registers_t*)0x0a00a000)     /* FUSES Registers Address      */
#define FUSES_DALCFG_REGS                ((fuses_dalcfg_registers_t*)0x0a004000)       /* FUSES Registers Address      */
#define FUSES_USERCFG1_REGS              ((fuses_usercfg1_registers_t*)0x0a000000)     /* FUSES Registers Address      */
#define FUSES_USERCFG2_REGS              ((fuses_usercfg1_registers_t*)0x0a008000)     /* FUSES Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x44010000)               /* GCLK Registers Address       */
#define HMATRIX_REGS                     ((hmatrix2_registers_t*)0x44806000)           /* HMATRIX Registers Address    */
#define HSM_REGS                         ((hsm_registers_t*)0x48000000)                /* HSM Registers Address        */
#define IDAU_REGS                        ((idau_registers_t*)0x4480c000)               /* IDAU Registers Address       */
#define MCLK_REGS                        ((mclk_registers_t*)0x44012000)               /* MCLK Registers Address       */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x4400e000)         /* OSC32KCTRL Registers Address */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x4400c000)            /* OSCCTRL Registers Address    */
#define PAC_REGS                         ((pac_registers_t*)0x4401c000)                /* PAC Registers Address        */
#define PCC_REGS                         ((pcc_registers_t*)0x45018000)                /* PCC Registers Address        */
#define PDEC_REGS                        ((pdec_registers_t*)0x4501c000)               /* PDEC Registers Address       */
#define PM_REGS                          ((pm_registers_t*)0x44006000)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x44800000)               /* PORT Registers Address       */
#define PORT_SEC_REGS                    ((port_registers_t*)0x44801000)               /* PORT Registers Address       */
#define PRM_REGS                         ((prm_registers_t*)0x4480a000)                /* PRM Registers Address        */
#define PTC_REGS                         ((ptc_registers_t*)0x45014000)                /* PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x4400a000)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x44018000)                /* RTC Registers Address        */
#define SDMMC0_REGS                      ((sdmmc_registers_t*)0x45026000)              /* SDMMC0 Registers Address     */
#define SDMMC1_REGS                      ((sdmmc_registers_t*)0x45028000)              /* SDMMC1 Registers Address     */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x44810000)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x44812000)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x44814000)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x44816000)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x45000000)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x45002000)             /* SERCOM5 Registers Address    */
#define SERCOM6_REGS                     ((sercom_registers_t*)0x45004000)             /* SERCOM6 Registers Address    */
#define SERCOM7_REGS                     ((sercom_registers_t*)0x45006000)             /* SERCOM7 Registers Address    */
#define SIG_REGS                         ((sig_registers_t*)0xe000ef00)                /* SIG Registers Address        */
#define SIG_NS_REGS                      ((sig_registers_t*)0xe002ef00)                /* SIG_NS Registers Address     */
#define SPI_IXS_REGS                     ((spi_ixs_registers_t*)0x45016000)            /* SPI_IXS Registers Address    */
#define SQI_REGS                         ((sqi_registers_t*)0x0ffff000)                /* SQI Registers Address        */
#define SUPC_REGS                        ((supc_registers_t*)0x44008000)               /* SUPC Registers Address       */
#define TCC0_REGS                        ((tcc_registers_t*)0x44818000)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x4481a000)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x4481c000)                /* TCC2 Registers Address       */
#define TCC3_REGS                        ((tcc_registers_t*)0x4481e000)                /* TCC3 Registers Address       */
#define TCC4_REGS                        ((tcc_registers_t*)0x45008000)                /* TCC4 Registers Address       */
#define TCC5_REGS                        ((tcc_registers_t*)0x4500a000)                /* TCC5 Registers Address       */
#define TCC6_REGS                        ((tcc_registers_t*)0x4500c000)                /* TCC6 Registers Address       */
#define TCC7_REGS                        ((tcc_registers_t*)0x4500e000)                /* TCC7 Registers Address       */
#define TRAM_REGS                        ((tram_registers_t*)0x4401e000)               /* TRAM Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x45024000)               /* TRNG Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x4502a000)                /* USB Registers Address        */
#define USBHS_REGS                       ((usbhs_registers_t*)0x46000000)              /* USBHS Registers Address      */
#define WDT_REGS                         ((wdt_registers_t*)0x44016000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

